In [68]:
import sqlite3
import pandas as pd

In [69]:
con = sqlite3.connect(':memory:')

In [70]:
table_names = [
    'Categories',   # –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ —Ç–æ–≤–∞—Ä–æ–≤
    'Customers',    # –∑–∞–∫–∞–∑—á–∏–∫–∏
    'Employees',    # —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–∏
    'OrderDetails', # –¥–µ—Ç–∞–ª–∏ –∑–∞–∫–∞–∑–æ–≤
    'Orders',       # –∑–∞–∫–∞–∑—ã
    'Products',     # —Ç–æ–≤–∞—Ä—ã
    'Shippers',     # –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∏
    'Suppliers',    # –ø–æ—Å—Ç–∞–≤—â–∏–∫–∏
]

In [71]:
for table in table_names:
    data = pd.read_csv(f'{table}.csv', sep = ';')
    data.to_sql(table, con, index=False, if_exists='replace')

In [72]:
pd.read_sql(
    '''
    SELECT * FROM Products
    limit 2
    ''',
    con,
)

   ProductID ProductName  SupplierID  CategoryID                Unit  Price
0          1       Chais           1           1  10 boxes x 20 bags   18.0
1          2       Chang           1           1  24 - 12 oz bottles   19.0

In [73]:
tasks = 0

### –í—Å–µ –∑–∞–¥–∞–Ω–∏—è –Ω—É–∂–Ω–æ –≤—ã–ø–æ–ª–Ω–∏—Ç—å —Ç–æ–ª—å–∫–æ —Å –ø–æ–º–æ—â—å—é sql

### 1. –í—ã–±–µ—Ä–∏—Ç–µ –∑–∞–∫–∞–∑—á–∏–∫–æ–≤ –∏–∑ –ì–µ—Ä–º–∞–Ω–∏–∏, –§—Ä–∞–Ω—Ü–∏–∏ –∏ –ú–∞–¥—Ä–∏–¥–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏–µ, —Å—Ç—Ä–∞–Ω—É –∏ –∞–¥—Ä–µ—Å.

In [74]:
tasks+=1

pd.read_sql(
    '''
    SELECT CustomerName, Country, Address, City
    FROM Customers
    WHERE Country in ("Germany","France","Madrid") OR city = "Madrid"
    Limit 10
    ''',
    con,
)

,CustomerName,Country,Address,City
0,Alfreds Futterkiste,Germany,Obere Str. 57,Berlin
1,Blauer See Delikatessen,Germany,Forsterstr. 57,Mannheim
2,Blondel p√®re et fils,France,"24, place Kl√©ber",Strasbourg
3,B√≥lido Comidas preparadas,Spain,"C/ Araquil, 67",Madrid
4,Bon app',France,"12, rue des Bouchers",Marseille
5,Drachenblut Delikatessend,Germany,Walserweg 21,Aachen
6,Du monde entier,France,"67, rue des Cinquante Otages",Nantes
7,FISSA Fabrica Inter. Salchichas S.A.,Spain,"C/ Moralzarzal, 86",Madrid
8,Folies gourmandes,France,"184, chauss√©e de Tournai",Lille
9,Frankenversand,Germany,Berliner Platz 43,M√ºnchen

### 2. –í—ã–±–µ—Ä–∏—Ç–µ —Ç–æ–ø 3 —Å—Ç—Ä–∞–Ω—ã –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑—á–∏–∫–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–ø–∏—Å–µ–π.

In [75]:
tasks+=1
pd.read_sql(
    '''
    SELECT Country, Count(Country) as Count 
    FROM Customers 
    GROUP BY Country
    ORDER BY Count(*) DESC
    limit 3
    ''',
    con,
)

   Country  Count
0      USA     13
1  Germany     11
2   France     11

### 3. –í—ã–±–µ—Ä–∏—Ç–µ –ø–µ—Ä–µ–≤–æ–∑—á–∏–∫–∞, –∫–æ—Ç–æ—Ä—ã–π –æ—Ç–ø—Ä–∞–≤–∏–ª 10-–π –ø–æ –≤—Ä–µ–º–µ–Ω–∏ –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ, –∏ –¥–∞—Ç—É –æ—Ç–ø—Ä–∞–≤–ª–µ–Ω–∏—è.

In [76]:
tasks+=1
pd.read_sql(
    '''
    SELECT ShipperName, OrderDate
    FROM Shippers 
    left join Orders
    on Orders.ShipperID = Shippers.ShipperID
    ORDER BY OrderID ASC
    LIMIT 1 OFFSET 9
    ''',
    con,
)

        ShipperName   OrderDate
0  Federal Shipping  16.07.1996

### 4. –í—ã–±–µ—Ä–∏—Ç–µ —Å–∞–º—ã–π –¥–æ—Ä–æ–≥–æ–π –∑–∞–∫–∞–∑, –≤—ã–≤–µ–¥–∏—Ç–µ —Å–ø–∏—Å–æ–∫ —Ç–æ–≤–∞—Ä–æ–≤ —Å –∏—Ö —Ü–µ–Ω–∞–º–∏.

In [77]:
tasks+=1
pd.read_sql(
    '''
    SELECT ProductName, Price
    FROM Products
    join OrderDetails
    on Products.ProductID = OrderDetails.ProductID
    where OrderID = 
        (
            select a.OrderID as OrderID
            from
            (
            SELECT OrderID, sum(Price) as Price 
            FROM Products
            join OrderDetails
            on Products.ProductID = OrderDetails.ProductID 
            Group by OrderID
            Order by Price Desc
            limit 1 ) as a
        )
    ''',
    con,
)

               ProductName   Price
0        R√∂ssle Sauerkraut   45.60
1  Th√ºringer Rostbratwurst  123.79
2            C√¥te de Blaye  263.50
3                 Maxilaku   20.00
4                Tourti√®re    7.45

### 5. –ö–∞–∫–æ–π —Ç–æ–≤–∞—Ä –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –µ–¥–∏–Ω–∏—Ü —Ç–æ–≤–∞—Ä–∞, –≤—ã–≤–µ–¥–∏—Ç–µ –µ–≥–æ –Ω–∞–∑–≤–∞–Ω–∏–µ –∏ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –µ–¥–∏–Ω–∏—Ü –≤ –∫–∞–∂–¥–æ–º –∏–∑ –∑–∞–∫–∞–∑–æ–≤.

In [78]:
tasks+=1
pd.read_sql(
    '''
    SELECT OrderID, ProductName, Quantity
    FROM Products
    join OrderDetails
    on Products.ProductID = OrderDetails.ProductID
    where ProductName in
            (
                select a.ProductName as ProductName
                from
                    (SELECT ProductName,sum(Quantity) as Quantity
                    FROM Products
                    join OrderDetails
                    on Products.ProductID = OrderDetails.ProductID
                    group by ProductName
                    order by Quantity desc
                    limit 1) a
            )
    group by OrderID
    order by Quantity desc
    ''',
    con,
)

    OrderID        ProductName  Quantity
0     10359  Gorgonzola Telino        70
1     10390  Gorgonzola Telino        60
2     10342  Gorgonzola Telino        56
3     10376  Gorgonzola Telino        42
4     10272  Gorgonzola Telino        40
5     10393  Gorgonzola Telino        32
6     10374  Gorgonzola Telino        30
7     10356  Gorgonzola Telino        30
8     10335  Gorgonzola Telino        25
9     10363  Gorgonzola Telino        20
10    10253  Gorgonzola Telino        20
11    10273  Gorgonzola Telino        15
12    10423  Gorgonzola Telino        14
13    10325  Gorgonzola Telino         4

### 6. –í—ã–≤–µ–¥–∏—Ç–µ —Ç–æ–ø 5 –ø–æ—Å—Ç–∞–≤—â–∏–∫–æ–≤ –ø–æ –∫–æ–ª–∏—á–µ—Å—Ç–≤—É –∑–∞–∫–∞–∑–æ–≤, –≤—ã–≤–µ–¥–∏—Ç–µ –∏—Ö –Ω–∞–∑–≤–∞–Ω–∏—è, —Å—Ç—Ä–∞–Ω—É, –∫–æ–Ω—Ç–∞–∫—Ç–Ω–æ–µ –ª–∏—Ü–æ –∏ —Ç–µ–ª–µ—Ñ–æ–Ω.

In [79]:
tasks+=1
pd.read_sql(
    '''
    SELECT SupplierName, Country, ContactName, Phone
    FROM Suppliers
    where SupplierID in 
        (
            select a.SupplierID
            from
            (SELECT SupplierID, count(OrderID) as Sum_Orders
            FROM Products
            JOIN OrderDetails
            on Products.ProductID = OrderDetails.ProductID
            group by SupplierID
            order by Sum_Orders desc
            limit 5) as a
        )
    ''', 
    con, 
)

                        SupplierName    Country   ContactName           Phone
0                      Pavlova, Ltd.  Australia   Ian Devling   (03) 444-2343
1           Specialty Biscuits, Ltd.         UK  Peter Wilson  (161) 555-4448
2  Plutzer Lebensmittelgro√üm√§rkte AG    Germany   Martin Bein    (069) 992755
3            Formaggi Fortini s.r.l.      Italy    Elio Rossi    (0544) 60323
4                    Norske Meierier     Norway  Beate Vileid     (0)2-953010

### 7. –ö–∞–∫—É—é –∫–∞—Ç–µ–≥–æ—Ä–∏—é —Ç–æ–≤–∞—Ä–æ–≤ –∑–∞–∫–∞–∑—ã–≤–∞–ª–∏ –±–æ–ª—å—à–µ –≤—Å–µ–≥–æ –ø–æ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –≤ –ë—Ä–∞–∑–∏–ª–∏–∏, –≤—ã–≤–µ–¥–∏—Ç–µ —Å—Ç—Ä–∞–Ω—É, –Ω–∞–∑–≤–∞–Ω–∏–µ –∫–∞—Ç–µ–≥–æ—Ä–∏–∏ –∏ —Å—É–º–º—É.

In [80]:
tasks+=1
pd.read_sql(
    '''
    SELECT  Country, CategoryName, sum(Price) as 'sum_by_orders'

    FROM Products
    join OrderDetails
        on Products.ProductID = OrderDetails.ProductID
    join Categories
        on Products.CategoryID = Categories.CategoryID
    join Orders
        on Orders.OrderID = OrderDetails.OrderID
    join Customers
        on Customers.CustomerID = Orders.CustomerID
    
    where Country = 'Brazil'
    group by Country, CategoryName
    order by sum_by_orders desc
    limit 1
    ''',
    con,
)

  Country CategoryName  sum_by_orders
0  Brazil    Beverages         405.75

### 8. –ö–∞–∫–∞—è —Ä–∞–∑–Ω–∏—Ü–∞ –≤ —Å—Ç–æ–∏–º–æ—Å—Ç–∏ –º–µ–∂–¥—É —Å–∞–º—ã–º –¥–æ—Ä–æ–≥–∏–º –∏ —Å–∞–º—ã–º –¥–µ—à–µ–≤—ã–º –∑–∞–∫–∞–∑–æ–º –∏–∑ –°–®–ê.

In [81]:
tasks+=1
pd.read_sql(
    '''
    
        SELECT *
        FROM 
        (select Country, c.OrderID as OrderID, sum(Price) as 'sum_order_price'
        from Customers a
        join Orders b
            on a.CustomerID = b.CustomerID 
        join OrderDetails c 
            on b.OrderID = c.OrderID 
        join Products d
            on c.ProductID = d.ProductID 
            
            where Country = 'USA'
            group by c.OrderID
            order by sum_order_price desc
            limit 1) as e
    
    union all
    
        SELECT *
        FROM 
        (select Country, c.OrderID as OrderID, sum(Price) as 'sum_order_price'
        from Customers a
        join Orders b
            on a.CustomerID = b.CustomerID 
        join OrderDetails c 
            on b.OrderID = c.OrderID 
        join Products d
            on c.ProductID = d.ProductID 
            
            where Country = 'USA'
            group by c.OrderID
            order by sum_order_price asc
            limit 1) as e
    
    ''',
    con,
)

  Country  OrderID  sum_order_price
0     USA    10329           336.59
1     USA    10271             2.50

### 9. –í—ã–≤–µ–¥–∏—Ç–µ –∫–æ–ª–∏—á–µ—Å—Ç–≤–æ –∑–∞–∫–∞–∑–æ–≤ —É –∫–∞–∂–¥–æ–≥–æ –∏—Ö —Ç—Ä–µ—Ö —Å–∞–º—ã—Ö –º–æ–ª–æ–¥—ã—Ö —Å–æ—Ç—Ä—É–¥–Ω–∏–∫–æ–≤, –∞ —Ç–∞–∫–∂–µ –∏–º—è –∏ —Ñ–∞–º–∏–ª–∏—é –≤–æ –≤—Ç–æ—Ä–æ–π –∫–æ–ª–æ–Ω–∫–µ.

In [82]:
# –í —ç—Ç–æ–º –∑–∞–¥–∞–Ω–∏–∏ —è –∑–Ω–∞—Ç–Ω–æ —Å—á–∏—Ç–µ—Ä–∏–ª :) —Ç–∞–∫ –∫–∞–∫ —É–∂–µ –º–Ω–æ–≥–æ —á—Ç–æ –≤ –∏–Ω—Ç–µ—Ä–Ω–µ—Ç–µ –ø–µ—Ä–µ—Ä—ã–ª –∏ –∏–¥–µ–π –±–æ–ª—å—à–µ –Ω–µ –±—ã–ª–æ, –Ω–æ —Å—á–∏—Ç–∞—é —á—Ç–æ —Ç–∞–∫ —É–¥–∞–ª–æ—Å—å 
# –°–æ–≥–ª–∞—Å–Ω–æ –¢–ó –¥–∞—Ç—å —á–∞—Å—Ç–∏—á–Ω–æ —Ö–æ—Ä–æ—à–∏–π —Ä–µ–∑—É–ª—å—Ç–∞—Ç)

with con:
    cur = con.cursor()   
    cur.execute("UPDATE Employees SET Photo = '1968.12' WHERE Photo = 'EmpID1.pic'")
    cur.execute("UPDATE Employees SET Photo = '1952.02' WHERE Photo = 'EmpID2.pic'")
    
    cur.execute("UPDATE Employees SET Photo = '1963.08' WHERE Photo = 'EmpID3.pic'")
    cur.execute("UPDATE Employees SET Photo = '1958.09' WHERE Photo = 'EmpID4.pic'")
    cur.execute("UPDATE Employees SET Photo = '1955.03' WHERE Photo = 'EmpID5.pic'")
    cur.execute("UPDATE Employees SET Photo = '1963.07' WHERE Photo = 'EmpID6.pic'")
    cur.execute("UPDATE Employees SET Photo = '1960.05' WHERE Photo = 'EmpID7.pic'")
    cur.execute("UPDATE Employees SET Photo = '1958.01' WHERE Photo = 'EmpID8.pic'")
    cur.execute("UPDATE Employees SET Photo = '1969.07' WHERE Photo = 'EmpID9.pic'")
    cur.execute("UPDATE Employees SET Photo = '1928.09' WHERE Photo = 'EmpID10.pic'")

In [83]:
tasks+=1
pd.read_sql(
    '''
    select sum_orders, (FirstName || " " ||  LastName) as 'Full_Name'
    from
    (SELECT LastName, FirstName, Photo as Birth_info , BirthDate, count(OrderID) as 'sum_orders'
    FROM Employees a
    join Orders b
    on a.EmployeeID = b.EmployeeID
    group by FirstName
    order by Photo desc
    limit 4
    ) as a
    ''',
    con,
)

   sum_orders        Full_Name
0           6   Anne Dodsworth
1          29    Nancy Davolio
2          31  Janet Leverling
3          18   Michael Suyama

### 10. –°–∫–æ–ª—å–∫–æ –±–∞–Ω–æ–∫ –∫—Ä–∞–±–æ–≤–æ–≥–æ –º—è—Å–∞ –≤—Å–µ–≥–æ –±—ã–ª–æ –∑–∞–∫–∞–∑–∞–Ω–æ.

In [84]:
tasks+=1
pd.read_sql(
    '''
    SELECT ProductName, sum(Quantity) as Quantity
    FROM OrderDetails a
    join Products b
    on a.ProductID = b.ProductID
    where ProductName like '%Crab%'
    ''',
    con,
)

        ProductName  Quantity
0  Boston Crab Meat       256

In [85]:
if tasks==10:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ')
else:
    print('–í—ã–ø–æ–ª–Ω–µ–Ω—ã –Ω–µ –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è! üôÄ')

–í—ã–ø–æ–ª–Ω–µ–Ω—ã –≤—Å–µ –∑–∞–¥–∞–Ω–∏—è üôÇ